app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Youngs"], ["updated_at", "2020-10-30 23:31:16.194520"], ["id", 4]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))